import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-post',
  templateUrl: './post.component.html',
  styleUrls: ['./post.component.scss']
})
export class PostComponent implements OnInit {
  data = {};
  post = {
    "data": {
    "_id": "5f157a1d3174c034cc24e62d",
    "bid": 476,
    "author": 77,
    "title": "ನಗರದೊಳಿಲ್ಲ ಜನರು",
    "body": "ನಗರದೊಳಿಲ್ಲ ಜನರು, ಈ\r\nನಗರದೊಳಿಲ್ಲ, ಜನರೆತ್ತ\r\nಹೋಗಿಹರೋ ವಲಸೆ, ಕಾಣೆ ನಾ\r\nನಗರದೊಳಿಲ್ಲವೈ ಜನರು!\r\n\r\nಜನರಿಲ್ಲದೇ ಬೀದಿಯೆಲ್ಲವು ಬಣಬಣ\r\nಎತ್ತ ನೋಡಿದರೂ ಯಾರ\r\nಸುಳಿವಿಲ್ಲ, ಇಲ್ಲೆಲ್ಲವು ಖಾಲಿಖಾಲಿ\r\n\r\nಬಾರದಿಹರಂತೆ ಹೊರಗೆಲ್ಲಿಯೂ\r\nಈ ವೈರಾಣುವಿಗೆದರಿ\r\nಇರುವರಂತೆ ಮನೆಯ\r\nಬೆಚ್ಚಗಿನ ಗೂಡ ಸೇರಿ\r\n\r\nಹೋಗು ಹೋಗೆಂದಾಚೆಗೆಂದರೆ\r\nಹೋಗುವುದೇ ವೈರಾಣು,\r\nಹೊಕ್ಕು ಇದಾಗಿಸಿಹುದೆಲ್ಲರ\r\nಬಾಳನು ಹೈರಾಣು\r\n\r\nಹೊರದೇಶದಿಂ ಬಂದವರೆಲ್ಲರ\r\nಕಟ್ಟುನಿಟ್ಟಿನ  ತಪಾಸಣೆ\r\nಮುಗಿದಿಲ್ಲವಿನ್ನೂ ಅವರ ಬಳಿ\r\nಸುಳಿದವರ ವಿಚಾರಣೆ\r\n\r\nದಿನದಿನವೂ ಏರುತಿಹುದು\r\nಪೀಡಿತರ ಅಂಕೆಸಂಖೆ\r\nಕೆಮ್ಮಿದರೂ, ಸೀನಿದರೂ\r\nರೋಗವಿರಬಹುದೆಂಬ ಶಂಕೆ\r\n\r\nಆಯಿತು ಕೆಲವರಿಗೆ ಮನೆಯೇ\r\nಮಂತ್ರಾಲಯ, ಮನೆಯೇ ಕಾರ್ಯಲಯ,\r\nಹಲವರಿಗೆ ರಜೆಯ ಮಜೆ,\r\nಇನ್ನುಳಿದವರಿಗೆ ರೋಗ ಹತ್ತಿಕ್ಕುವ ಸಜೆ\r\n\r\nಚಿತ್ರವಂತೆ, ಕವಿತೆಯಂತೆ\r\nಕಥನವಂತೆ ಕಾಲದೂಡಲು\r\nಗೀತ, ಚಲನಚಿತ್ರ, ಚೂರು ಮಾತು\r\nಈ ಸಮಯವ ಕಳೆಯಲು\r\n\r\nಇನ್ನೆಷ್ಟು ದಿನವೋ ತಿಳಿಯದು\r\nಈ ಇರುಸು ಮುರುಸು\r\nಯಾರಿಚ್ಚೆಯೋ, ಶಾಪವೋ\r\nಬಂದಿತೆಮ್ಮಗಳ ಮೇಲೆಕೆ ಈ ಮುನಿಸು\r\n\r\nಬೇಗಬೇಗನೆ ಎಲ್ಲೆಡೆಯೂ\r\nಆಗಲಿ ರೋಗಮುಕ್ತ,\r\nಮುಂದಿನ ಹೋರಾಟ\r\nಗಳಿಗಿನ್ನೂ ನಾವಾಗುತ ಶಕ್ತ\r\n\r\nನಗರದೊಳಿಲ್ಲ ಜನರು, ಈ\r\nನಗರದೊಳಿಲ್ಲ ಜನರು!!",
    "img": "wall_pic/1585829272.jpg",
    "views": 272,
    "likes": 7,
    "postedon": "2020-04-02T12:07:52.000Z",
    "is_enabled": true,
    "audio_path": null,
    "profile": "5f156f64b5bfe92f5ed18407",
    "__v": 0
    },
    "profile": {
    "_id": "5f156f64b5bfe92f5ed18407",
    "uid": 77,
    "name": "ರಾಘವೇಂದ್ರ ರಾವ್ .ಕೆ ",
    "about": "ರಾಘವೇಂದ್ರ ಒಬ್ಬ ಬಹುಮುಖ ಪ್ರತಿಭೆ..ಬೆಂಗಳೂರಿನ ಐ. ಟಿ ಕಂಪನಿಯೊಂದರ ಉದ್ಯೋಗಿಯಾರುವ ಇವರು ಉತ್ತಮ ಚಿತ್ರ ಕಲಾವಿದ ಕೂಡಾ ಹೌದು. ಕನ್ನಡ ಪರ ಕೆಲಸಗಳಲ್ಲಿ ಆಸಕ್ತಿಯಿಂದ ಭಾಗವಹಿಸುತ್ತಾರೆ.. \"Kotlin for Enterprise Applications using Java EE\" ಎಂಬ ಪುಸ್ತಕದ ಬರಹಗಾರರಾಗಿರುವ ಇವರು ತಂತ್ರಜ್ಞಾನ ದ ಬಗ್ಗೆ ಲೇಖನಗಳನ್ನಷ್ಟೇ ಅಲ್ಲದೇ ಕನ್ನಡ ಸಾಹಿತ್ಯ ಲೋಕದಲ್ಲಿ ಪಯಣಿಸುವ ಕನಸಿನಲ್ಲಿ ನಮ್ಮ \"ಇಸ್ಸನಿ\" ಯ ಜೊತೆ ಸೇರಿದ್ದಾರೆ..ಅವರ ಬರಹಳಿಗೆ \"ಇಸ್ಸನಿ\" ವೇದಿಕೆಯಾಗಲಿದೆ..",
    "pic": "img/raghavendra-philips.jpg",
    "mail": "",
    "__v": 0
    }
  }
  constructor() { }
  // getData(url){
  //   return this.http.get<any>(url);
  // }

  ngOnInit(): void {
    // this.data = this.getData('http://34.67.33.183/post/427');
    // console.log(this.data)
    
    
  }

}
